# Задача 4: Петя, Катя и Сережа делают из бумаги журавликов. Вместе они сделали S журавликов. 
# Сколько журавликов сделал каждый ребенок, если известно, что Петя и Сережа сделали одинаковое количество журавликов, 
# а Катя сделала в два раза больше журавликов, чем Петя и Сережа вместе?

Zuravl = int(input('Введите количество журавликов '))


if Zuravl % 6 != 0:
    print('Задача нерешаема')
else:
    Petr = Zuravl / 6
    Sergey = Zuravl / 6
    Ekaterina = (Sergey + Petr) * 2
    print(int(Petr), int(Ekaterina), int(Sergey))