# Задача 6: Вы пользуетесь общественным транспортом? Вероятно, вы расплачивались за проезд и получали билет с номером. Счастливым билетом называют такой билет с шестизначным номером, 
# где сумма первых трех цифр равна сумме последних трех. Т.е. билет с номером 385916 – счастливый, т.к. 3+8+5=9+1+6. 
# Вам требуется написать программу, которая проверяет счастливость билета.


bilet_number = str(input('Номер билета с шестизначным номером '))
if len(bilet_number) != 6:
    print('Введите шестизначный номер!')
else:
    sum_left = 0
    sum_right = 0
    for digit in range(len(bilet_number)):
        if digit < 3:
            sum_left += int(bilet_number[digit])
        else:
            sum_right += int(bilet_number[digit])
    if sum_left == sum_right:
        print('Yes')
    else:
        print('No')